manmuqingshan/trail-mate/platform/nrf52/arduino_common/src/ble/meshtastic_ble.cpp
    if (phone_session_)
    {
        phone_session_->pumpIncomingAppData();
    }

    processPendingPairingRequest();
    processPendingToRadio();
    flushPendingFromNumNotify();
    logDeferredBleEvents();
    flushPendingConfigSaves(false);

    const uint32_t now_ms = millis();
    if (!connected_ && remembered_phone_peer_valid_ && !directed_advertising_attempted_)
    {
        startPhoneAdvertising(true);
    }

    if (directed_advertising_active_ && !connected_ &&
        static_cast<int32_t>(now_ms - directed_advertising_until_ms_) >= 0)
    {
        bleLogBoth("[BLE][nrf52][mt] directed advertising window elapsed; fallback to undirected");
        startPhoneAdvertising(false);
    }

    if (!Bluefruit.connected() && !Bluefruit.Advertising.isRunning())
    {
        startPhoneAdvertising(!directed_advertising_attempted_);
    }

    if (!connected_ && static_cast<int32_t>(now_ms - next_ble_idle_log_ms_) >= 0)
    {
        const ble_gap_addr_t own_addr = Bluefruit.getAddr();
        char own_addr_text[24] = {};
        formatBleAddress(own_addr, own_addr_text, sizeof(own_addr_text));
        char peer_addr_text[24] = {};
        if (remembered_phone_peer_valid_)
        {
            formatBleAddress(remembered_phone_peer_, peer_addr_text, sizeof(peer_addr_text));
        }
        bleLogBoth("[BLE][nrf52][mt] idle connected=%u adv=%u directed=%u directed_tried=%u own=%s type=%s peer=%s peer_type=%s peer_bonded=%u notify=%u cfg=%u send=%u name=%s",
                   connected_ ? 1U : 0U,
                   Bluefruit.Advertising.isRunning() ? 1U : 0U,
                   directed_advertising_active_ ? 1U : 0U,
                   directed_advertising_attempted_ ? 1U : 0U,
                   own_addr_text,
                   bleAddressTypeName(own_addr.addr_type),
                   remembered_phone_peer_valid_ ? peer_addr_text : "-",
                   remembered_phone_peer_valid_ ? bleAddressTypeName(remembered_phone_peer_.addr_type) : "-",
                   remembered_phone_peer_bonded_ ? 1U : 0U,
                   from_num_notify_enabled_ ? 1U : 0U,
                   phone_session_ && phone_session_->isConfigFlowActive() ? 1U : 0U,
                   phone_session_ && phone_session_->isSendingPackets() ? 1U : 0U,
                   device_name_.c_str());
        next_ble_idle_log_ms_ = now_ms + kBleIdleStateLogIntervalMs;
    }
}

void MeshtasticBleService::handleIncomingTextFromApp(const chat::MeshIncomingText& msg)
{
    if (!phone_session_ || !connected_)
    {
        bleLogBoth("[BLE][nrf52][mt] phone projection skip kind=text reason=not-connected from=%08lX id=%08lX",
                   static_cast<unsigned long>(msg.from),
                   static_cast<unsigned long>(msg.msg_id));
        return;
    }

    if (phone_session_)
    {
        phone_session_->onIncomingText(msg);
    }
}

void MeshtasticBleService::handleOutgoingTextFromApp(const chat::MeshIncomingText& msg)
{
    if (!phone_session_ || !connected_)
    {
        bleLogBoth("[BLE][nrf52][mt] phone projection skip kind=local_text reason=not-connected from=%08lX id=%08lX",
                   static_cast<unsigned long>(msg.from),
                   static_cast<unsigned long>(msg.msg_id));
        return;
    }

    if (phone_session_)
    {
        Serial2.printf("[BLE][nrf52][mt] local text mirror id=%08lX from=%08lX to=%08lX len=%u\n",
                       static_cast<unsigned long>(msg.msg_id),
                       static_cast<unsigned long>(msg.from),
                       static_cast<unsigned long>(msg.to),
                       static_cast<unsigned>(msg.text.size()));
        phone_session_->onIncomingText(msg);
    }
}

void MeshtasticBleService::handleIncomingDataFromApp(const chat::MeshIncomingData& msg)
{
    if (!phone_session_ || !connected_)
    {
        bleLogBoth("[BLE][nrf52][mt] phone projection skip kind=data reason=not-connected from=%08lX to=%08lX pkt=%08lX port=%u len=%u",
                   static_cast<unsigned long>(msg.from),
                   static_cast<unsigned long>(msg.to),
                   static_cast<unsigned long>(msg.packet_id),
                   static_cast<unsigned>(msg.portnum),
                   static_cast<unsigned>(msg.payload.size()));
        return;
    }

    if (phone_session_)
    {
        bleLogBoth("[BLE][nrf52][mt] onIncomingData from=%08lX to=%08lX pkt=%08lX port=%u len=%u",
                   static_cast<unsigned long>(msg.from),
                   static_cast<unsigned long>(msg.to),
                   static_cast<unsigned long>(msg.packet_id),
                   static_cast<unsigned>(msg.portnum),
                   static_cast<unsigned>(msg.payload.size()));
        probeGpsGuard("ble_incoming_data_pre_session");
        phone_session_->onIncomingData(msg);
        probeGpsGuard("ble_incoming_data_post_session");
    }
}

bool MeshtasticBleService::isRunning() const
{
    return active_ && (Bluefruit.connected() || Bluefruit.Advertising.isRunning());
}

void MeshtasticBleService::setDeviceName(const std::string& name)
{
    device_name_ = name;
}

bool MeshtasticBleService::handleToRadio(const uint8_t* data, size_t len)
{
    last_ble_activity_ms_ = millis();
    const bool config_before = phone_session_ && phone_session_->isConfigFlowActive();
    const bool send_before = phone_session_ && phone_session_->isSendingPackets();
    probeGpsGuard("ble_to_radio_pre_handle");
    const bool ok = phone_session_ ? phone_session_->handleToRadio(data, len) : false;
    probeGpsGuard("ble_to_radio_post_handle");
    Serial2.printf("[BLE][nrf52][mt] handleToRadio len=%u ok=%u connected=%u notify=%u config=%u->%u send=%u->%u\n",
                   static_cast<unsigned>(len),
                   ok ? 1U : 0U,
                   connected_ ? 1U : 0U,
                   from_num_notify_enabled_ ? 1U : 0U,
                   config_before ? 1U : 0U,
                   (phone_session_ && phone_session_->isConfigFlowActive()) ? 1U : 0U,
                   send_before ? 1U : 0U,
                   (phone_session_ && phone_session_->isSendingPackets()) ? 1U : 0U);
    return ok;
}

void MeshtasticBleService::handleFromRadioReadRequest(uint16_t conn_handle,
                                                      uint16_t offset,
                                                      uintptr_t chr_ptr)
{
    pending_from_radio_auth_conn_handle_ = conn_handle;
    pending_from_radio_auth_offset_ = offset;
    pending_from_radio_auth_chr_ = chr_ptr;
    pending_from_radio_auth_svc_ = reinterpret_cast<uintptr_t>(this);
    pending_from_radio_auth_log_ = true;

    if (offset != 0)
    {
        authorizeRead(conn_handle);
        return;
    }

    last_ble_activity_ms_ = millis();
    writeNextFromRadioForRead(conn_handle);
    authorizeRead(conn_handle);
}

void MeshtasticBleService::writeNextFromRadioForRead(uint16_t conn_handle)
{
    if (!active_ || !connected_ || !phone_session_)
    {
        uint8_t empty = 0;
        probeGpsGuard("ble_from_radio_pre_write_empty_inactive");
        from_radio_.write(&empty, 0);
        probeGpsGuard("ble_from_radio_post_write_empty_inactive");
        pending_from_radio_empty_log_ = true;
        pending_from_radio_empty_reason_ = kFromRadioEmptyInactive;
        return;
    }

